import { useState } from "react";
import Container from "@/components/Layout/Container";
import styles from "./FAQ.module.css";
import FAQItem from "./FAQItem";
import FAQTab from "./FAQTab";
import Dropdown from "@/components/Layout/Dropdown";

// // ------------------------- DUMMY_DATA START -------------------------
const DUMMY_DATA_1 = [
  {
    id: "f1",
    title: "Часы работы центра?",
    answer:
      "Понедельник-пятница с 9.00 до 19.00, Суббота 9.00-16.00, Воскресенье выходной",
  },
  {
    id: "f2",
    title: "Как записаться на приём врача?",
    answer:
      "В Alta Medicus Clinic  прием специалистов и оказание медицинских услуг осуществляется по предварительной записи. Записаться можно по номеру телефона +7172 77 77 69, а также +7 775 477 8811. При наличии свободного времени у специалиста возможен прием без предварительной записи.",
  },
  {
    id: "f3",
    title: "Что будет если опоздать на прием?",
    answer:
      "Пациенту следует прибыть в клинику за 15 минут до начала приема для надлежащего оформления документов и своевременного начала приема. В случае опоздания Пациента на прием Клиника вправе перенести прием на другое время и дату, согласованные с Пациентом, так как опоздание одного ущемляет права другого на своевременный и полноценный прием. Если пациент не может явиться на прием в назначенное время, ему следует заранее, не менее чем за 1 час до приема, предупредить оператора контакт-центра по телефонам клиники.",
  },
  {
    id: "f4",
    title: "Возможен ли прием несовершеннолетних пациентов?",
    answer:
      "при оказании услуг несовершеннолетним (дети до 18 лет) – обязательно сопровождение одним из родителей с предъявлением его паспорта и свидетельства о рождении ребенка. Родственники и третьи лица при сопровождении несовершеннолетнего должны иметь нотариально заверенное согласие родителей или законных представителей.",
  },
  {
    id: "f5",
    title: "Как проходит консультация у врача?",
    answer:
      "Обычно первая консультация включает в себя беседу, стандартный осмотр, а также назначение дополнительных методов диагностики — специалист предполагает диагноз, и для подтверждения или исключения требуются лабораторные исследования, аппаратные и иные методы. На консультации врач составит дальнейший план действий, может порекомендовать обратиться к другому узкому специалисту при наличии показаний или привлечь коллег, чтобы обсудить сложный случай.",
  },
];
const DUMMY_DATA_2 = [
  {
    id: "f1",
    title: "Чем отличается европеизация век от блефаропластики?",
    answer:
      "Европеизация –это пластика век , при помощи которой изменяется форма и разрез азиатского строения глаза- создается складка верхнего века, которой раннее не было. Блефаропластика- это пластика возрастных изменений век. Удаляются излишки кожи, грыжевые мешки. За счет этого пациенты выглядят моложе.",
  },
  {
    id: "f2",
    title:
      "Как проходит реабилитация после установки имплантов молочной железы?",
    answer:
      "реабилитация длится около 30 дней и зависит от дисциплины пациента. За это время уходят отеки , синяки, формируется рубцовая капсула вокруг импланта, которая будет предопределять форму груди. Есть два режима, которые нужно соблюдать: 1) Ношение компрессионного белья. При несоблюдении этого режима могут возникнуть осложнения –смещение имплантов, ассиметрии. 2) Двигательный режим. При несоблюдении есть большая вероятность осложнений-серома, гематома.",
  },
  {
    id: "f3",
    title:
      "Насколько безопасны импланты молочных желез? Не повышается ли риск рака молочной железы?",
    answer:
      "Силиконовые импланты сами по себе не увеличивают риск рака молочной железы. Были проведены исследования, результаты которых показали, что у женщин с имплантами на 25-30% ниже заболеваемость раком молочной железы, чем у женщин того же возраста в целом.",
  },
  {
    id: "f4",
    title: "Можно ли изменить форму разреза глаз?",
    answer:
      "Да, можно, для этого проводят– Кантопластику. Операция на внутреннем или наружном углах глаза для коррекции «Монголоидного» разреза глаз на «европейский».",
  },
  {
    id: "f5",
    title: "Можно или нельзя кормить грудью после маммопластики?",
    answer:
      "Пациенток, безусловно, волнует возможность грудного вскармливания после пластики груди. Имплант устанавливается под мышцу, с молочной железой он не связан никак. В добавок молочная железа окутана своей капсулой, которая не позволяет хирургу каким-либо образом повредить млечные протоки. На качество молока грудные имплантаты не влияют, и они полностью безопасны для здоровья девушки и малыша. ",
  },
];
const DUMMY_DATA_3 = [
  {
    id: "f1",
    title: "Можно ли «прижигать» эрозию не рожавшим женщинам?",
    answer:
      "Можно, и даже есть случаи, когда это жизненно необходимо. В целом диагноз «Эрозия» устаревший термин, который не применяется в современной гинекологической терминологии. По сути это дефект слизистой оболочки шейки матки от простой эктопии, которая является вариантом нормы и её не следует «прижигать», до предраковых изменений- Дисплазий. Лечение дисплазий средней и тяжелой степени заключается в удалении пораженной ткани для предотвращения перехода в рак, это и называется «прижигание».",
  },
  {
    id: "f2",
    title: "Какой самый эффективный метод контрацепции?",
    answer:
      "Самый эффективный «двойной голландский метод» использование оральных контрацептивов + мужской презерватив. Защита от нежелательной беременности + инфекций, передающихся половым путем.",
  },
  {
    id: "f3",
    title: "Можно ли отсрочить климакс ?",
    answer:
      "Возрастное снижение уровней половых гормонов неизбежно- это процесс запрограммированной , генетически обусловленной гибели фолликулярного запаса яичников, повлиять на который медицина не в силе. Менопаузальная гормональная терапии позволяет снизить проявления дефицита половых гормонов и профилактировать отдаленные последствия климактерия, такие как остеопороз, артериальная гипертензия, болезнь Альцгеймера.",
  },
  {
    id: "f4",
    title:
      "Правда ли, что прием гормональных контрацептивов вызывает онкологические болезни?",
    answer:
      "Нет, не правда. Более того, есть многочисленные исследования подтвердившие безопасность приема оральных контрацептивов и доказывающие, что прием гормональных препаратов снижает риск развития онкологических болезней.",
  },
  {
    id: "f5",
    title: "Когда лучше планировать прием у гинеколога?",
    answer:
      "Если вы планируете ежегодное профилактическое посещение гинеколога, то лучше это сделать в период после менструации. В тех случаях, когда нужно проследить овуляцию или другие ситуации, врач пригласит вас повторно в середине цикла или перед менструацией.",
  },
];
const DUMMY_DATA_4 = [
  {
    id: "f1",
    title: "Сахарный диабет излечим?",
    answer:
      "Сахарный диабет 1 и 2 типа- это хроническое заболевание на всю жизнь, вылечить полностью невозможно, все методы лечения облегчают симптомы и предотвращают осложнения болезни.",
  },
  {
    id: "f2",
    title: "Как заподозрить диабет?",
    answer:
      "Чувство жажды, повышенное мочеиспускание, постоянный голод, изменения веса.",
  },
  {
    id: "f3",
    title: "О чём говорит высокий уровень пролактина?",
    answer:
      "Пролактин – один из гормонов выделяемый гипофизом- железой расположенной в головном мозге. Высокие уровни вне беременности и кормлении грудью могут быть при опухоли гипофиза- микро- или макропролактиномы.",
  },
  {
    id: "f4",
    title: "На что влияет пролактин?",
    answer:
      "Пролактин контролирует метаболизм, а также процессы роста и развития организма. Необходим для развития молочных желез, обеспечения лактации. Также он контролирует секрецию прогестерона и тормозит секрецию фолликулостимулирующего гормона , обеспечивая нормальный менструальный цикл. В крови мужчин и небеременных женщин он обычно присутствует в малых количествах. Высокие уровни пролактина подавляют овуляцию, тем самым приводят в гормональному бесплодию и невынашиванию беременности .",
  },
  {
    id: "f5",
    title:
      "Связано ли бесплодие и невынашивание с болезнями щитовидной железы?",
    answer:
      "Да, гипотиреоз- дефицит гормонов щитовидной железы может предотвратить выход яйцеклетки из яичника (овуляцию). У женщин страдающих гипотиреозом овуляции могут происходить реже или не быть вообще. Также, гипотиреоз может помешать оплодотворению яйцеклетки, а если все-таки оплодотворение наступило, то дальнейшее развитие эмбриона может быть нарушено. Это приводит к потере беременности .",
  },
];

// ------------------------- DUMMY_DATA END -------------------------
const FAQ = () => {
  const [toggleState, setToggleState] = useState(1);

  const toggleTab = (index) => {
    setToggleState(index);
  };

  return (
    <section>
      <Container>
        <div className={styles.header}>
          <p className="eyebrows">ВОПРОСЫ И ОТВЕТЫ</p>
          <h2>Часто Задаваемые Вопросы</h2>
          <p>
            Мы всегда стремимся ответить на все интересующие Вас вопросы
            развернуто и доступно!
          </p>
        </div>
        <div className={styles.body}>
          <FAQTab toggleState={toggleState} toggleTab={toggleTab} />
          <Dropdown toggleState={toggleState} toggleTab={toggleTab} />
          <div className={styles.FAQs}>
            <div
              className={
                toggleState === 1
                  ? `${styles.faqRow} ${styles.active}`
                  : styles.faqRow
              }
              onClick={() => toggleTab(1)}
            >
              {DUMMY_DATA_1.map((faqItem) => (
                <FAQItem
                  toggleState={toggleState}
                  toggleTab={toggleTab}
                  key={faqItem.id}
                  title={faqItem.title}
                  answer={faqItem.answer}
                />
              ))}
            </div>
            <div
              className={
                toggleState === 2
                  ? `${styles.faqRow} ${styles.active}`
                  : styles.faqRow
              }
              onClick={() => toggleTab(2)}
            >
              {DUMMY_DATA_2.map((faqItem) => (
                <FAQItem
                  toggleState={toggleState}
                  toggleTab={toggleTab}
                  key={faqItem.id}
                  title={faqItem.title}
                  answer={faqItem.answer}
                />
              ))}
            </div>
            <div
              className={
                toggleState === 3
                  ? `${styles.faqRow} ${styles.active}`
                  : styles.faqRow
              }
              onClick={() => toggleTab(3)}
            >
              {DUMMY_DATA_3.map((faqItem) => (
                <FAQItem
                  toggleState={toggleState}
                  toggleTab={toggleTab}
                  key={faqItem.id}
                  title={faqItem.title}
                  answer={faqItem.answer}
                />
              ))}
            </div>
            <div
              className={
                toggleState === 4
                  ? `${styles.faqRow} ${styles.active}`
                  : styles.faqRow
              }
              onClick={() => toggleTab(4)}
            >
              {DUMMY_DATA_4.map((faqItem) => (
                <FAQItem
                  toggleState={toggleState}
                  toggleTab={toggleTab}
                  key={faqItem.id}
                  title={faqItem.title}
                  answer={faqItem.answer}
                />
              ))}
            </div>
          </div>
        </div>
      </Container>
    </section>
  );
};

export default FAQ;
