import { useState } from "react";

import Container from "../Layout/Container";
import styles from "./Uslugi.module.css";
import UslugiDetails from "./UslugiDetails";

const items = [
  {
    id: "e1",
    title: "Пластическая хирургия",
    description:
      "Есть проблемы, которые решит только пластический хирург. Зато как решит: эффективно и надолго! Важно определиться, какой результат вы хотите получить и выбрать лучшего профессионала для вашей задачи.",
  },
  {
    id: "e2",
    title: "Гинекология",
    description:
      "Репродуктивное здоровье – залог личного счастья. Доверительные отношения, знания, деликатность, надежные и современные методы – то, что сделает ваш визит к женскому доктору приятным и результативным.",
  },
  {
    id: "e3",
    title: "УЗИ",
    description:
      "УЗИ – это современный быстрый и простой способ обследования органов и систем, который сегодня широко применяется во всех областях медицины.",
  },
  {
    id: "e4",
    title: "Эндокринология",
    description:
      "Правильный баланс гормонов важен для работы органов и систем нашего организма. Вовремя заметить нарушения или восстановить гормональный фон поможет врач-эндокринолог.",
  },
  {
    id: "e5",
    title: "Кардиология",
    description:
      "Кардиология занимается изучением, диагностикой и лечением сердечно-сосудистых заболеваний, то есть отвечает за нормальное кровообращение. Нарушения в этом процессе могут приводить к серьезным последствиям - инфарктам, инсультам и хроническим заболеваниям.",
  },
  {
    id: "e6",
    title: "Лор",
    description:
      "Отоларинголог – это врач, который лечит заболевания уха, горла и носа. Чаще его называют ЛОР-врачом. Причина, по которой эти три органа объединили в одной медицинской специальности, очень проста: инфекция имеет обыкновение кочевать из носа в ухо, а из горла – в нос, так что лечить разумнее все в комплексе.",
  },
  {
    id: "e7",
    title: "Процедурный кабинет",
    description:
      "Процедурный кабинет – важное звено в оказании квалифицированной медицинской помощи и неотъемлемая часть любого лечебного учреждения. Это специально организованный кабинет для проведения различных лечебно-профилактических процедур.",
  },
  {
    id: "e8",
    title: "Дерматология",
    description:
      "Здоровье кожи - это один из важнейших пунктов в вашей самооценке. Зависит оно во многом от внешних и внутренних факторов. Только правильный подход позволит выявить и устранить причину.",
  },
  {
    id: "e9",
    title: "Терапия",
    description:
      "Почти любое лечение начинается с посещения терапевта. Объясняется это просто: терапевт – специалист по широкому спектру заболеваний, который уже при первом посещении может установить предварительный диагноз, составить программу обследования и лечения.",
  },
  {
    id: "e10",
    title: "Неврология",
    description:
      "Головная боль, беспокойство, бессонница, боли в спине и шее - хорошо известные каждому человеку симптомы неврологических заболеваний. И, поскольку нервная система пронизывает работу всех органов и систем, часто отклонения в ее работе участвуют в развитии других заболеваний, корректируя, а, порой, и отягощая клиническую картину течения.",
  },
  {
    id: "e11",
    title: "Онкология",
    description:
      "Профилактика рака — это целая система комплексной профилактики онкологических новообразований, в составе которой выделяют первичную, вторичную и третичную профилактику. Дожидаться появления симптомов болезни не стоит, особенно учитывая наличие множества современных инструментов ее предупреждения.",
  },
];

const servicesSecond = [
  {
    id: "e7",
    title: "Процедурный кабинет",
    description:
      "Процедурный кабинет – важное звено в оказании квалифицированной медицинской помощи и неотъемлемая часть любого лечебного учреждения. Это специально организованный кабинет для проведения различных лечебно-профилактических процедур.",
  },
  {
    id: "e8",
    title: "Дерматология",
    description:
      "Здоровье кожи - это один из важнейших пунктов в вашей самооценке. Зависит оно во многом от внешних и внутренних факторов. Только правильный подход позволит выявить и устранить причину.г",
  },
  {
    id: "e9",
    title: "Терапия",
    description:
      "Почти любое лечение начинается с посещения терапевта. Объясняется это просто: терапевт – специалист по широкому спектру заболеваний, который уже при первом посещении может установить предварительный диагноз, составить программу обследования и лечения.",
  },
  {
    id: "e10",
    title: "Неврология",
    description:
      "Головная боль, беспокойство, бессонница, боли в спине и шее - хорошо известные каждому человеку симптомы неврологических заболеваний. И, поскольку нервная система пронизывает работу всех органов и систем, часто отклонения в ее работе участвуют в развитии других заболеваний, корректируя, а, порой, и отягощая клиническую картину течения.",
  },
  {
    id: "e11",
    title: "Онкология",
    description:
      "Профилактика рака — это целая система комплексной профилактики онкологических новообразований, в составе которой выделяют первичную, вторичную и третичную профилактику. Дожидаться появления симптомов болезни не стоит, особенно учитывая наличие множества современных инструментов ее предупреждения.",
  },
];

const Uslugi = () => {
  const [activeIndex, setActiveIndex] = useState(-1);

  const handleClick = (index) => {
    setActiveIndex(activeIndex === index ? -1 : index);
  };

  //   const [activeIndexTwo, setActiveIndexTwo] = useState(-1);

  //   const handleClickTwo = (index) => {
  //     setActiveIndexTwo(activeIndexTwo === index ? -1 : index);
  //   };

  return (
    <div>
      <Container>
        <div className={styles.header}>
          <h1>
            Мы предоставляем <span className="highlight">качественные</span> услуги
          </h1>
          <p>
            Самое главное для нас - это забота о качестве услуг, Вашем комфорте
            и конфиденциальности!
          </p>
        </div>
        <div className={styles.body}>
          <ul className={styles.column}>
            {items.map(({ title, description }, index) => (
              <UslugiDetails
                key={index}
                title={title}
                description={description}
                isOpen={activeIndex === index}
                onClick={() => handleClick(index)}
              />
            ))}
          </ul>
          {/* <ul className={styles.column}>
            {servicesSecond.map(({ title, description }, index) => (
              <UslugiDetails
                key={index}
                title={title}
                description={description}
                isOpen={activeIndexTwo === index}
                onClick={() => handleClickTwo(index)}
              />
            ))}
          </ul> */}
        </div>
      </Container>
    </div>
  );
};

export default Uslugi;
