import styles from "./HiringProcess.module.css";

const HiringProcess = () => {
  const hiringProcessMap = hiringData.map((section) => (
    <li key={section.index} className={styles.hiringDetails}>
      <h2 className={styles.blueText}>{section.index}</h2>

      <p className={styles.title}>{section.title}</p>

      <p>{section.text}</p>
    </li>
  ));

  return (
    <article>
      <p className={styles.title}>Процесс найма</p>
      <p className={styles.description}>
        Процесс найма для нашей клиники состоит из трех этапов.
      </p>
      <ul className={styles.hiringProcess}>{hiringProcessMap}</ul>
    </article>
  );
};

export default HiringProcess;

const hiringData = [
  {
    index: "01",
    title: "Проверка Документов",
    text: "  Мы проводим проверку документов, подтверждающих квалификацию иопыт работы кандидата, таких как дипломы, сертификаты,лицензии и другие профессиональные документы. Также мыпроверяем личную и финансовую историю кандидата, чтобыубедиться в его надежности и честности.",
  },
  {
    index: "02",
    title: "Собеседование",
    text: " После проверки документов мы приглашаем кандидата насобеседование, где обсуждаем его профессиональные навыки, опытработы, личностные качества и мотивацию. Мы также рассказываемо нашей клинике, ее ценностях и целях, чтобы убедиться, чтокандидат подходит нам не только по квалификации, но и по нашимобщим ценностям.",
  },
  {
    index: "03",
    title: "Найм",
    text: "Если кандидат успешно прошел проверку документов и собеседование, мы предлагаем ему официальное трудоустройство в нашей клинике. Мы обсуждаем с ним условия работы, зарплату, бенефиты и другие важные детали, чтобы убедиться, что мы находимся на одной волне и можем успешно работать вместе.",
  },
];
